namespace Yord.Crack.Begin.Chapter6
{
    // На шахматной доске 8х8 вырезают 2 противоположных по диагонали угла.
    // Есть 31 кость домино, каждая может закрыть 2 квадрата. Можно ли закрыть доску полностью?
    public class Task3
    {
        // Доска состоит из 32 черных и 32 белых клеток.
        // Удалив противоположные по диагонали, оставляем 30 клетки одного цвета и 32 другого     
        // Каждая кость занимает 1 белый и 1 черный квадрат, т.е. займет 31 черную и 31 белую
        // На доске же находится 32 клетки какого-то из цветов, значит закрыть ее всю - нельзя
    }
}
