namespace Yord.Crack.Begin.Chapter6
{
    // Есть кувшины 3л и 5л, бесконечно воды. Отмерить 4 литра 
    public class Task5
    {
        // 1. Заполнить 5л: 5/5  0/3
        // 2. Вылить в 3л из 5л: 2/5  3/3
        // 3. Опустошить 3л и вылить в него из 5л: 0/5  2/3
        // 4. Заполнить  5л и вылить в 3л до его заполнения: 4/5  3/3, получили 4 в первом
        
        // Если размеры двух кувшинов - взаимно простые числа, то при их переливании можно получить любое значение
        // от 1 до суммарного объема двух (от 1 до 8 в данном случае)
    }
}
